of-run/damBreakSnappyV2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// ************************************************************************* //
deltaT          0.001;
writeControl    adjustableRunTime;
writeInterval   0.025;
// ************************************************************************* //
application     interFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression uncompressed;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           1;
maxAlphaCo      1;
maxDeltaT       1;
// ************************************************************************* //
