of-run/damBreakSnappyV2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format  ascii;
  class   dictionary;
  object  blockMeshDict;
}

convertToMeters 1;

vertices (
  (-.25 -.25 .45)
  (8.25 -.25 .45)
  (8.25 4.75 .45)
  (-.25 4.75 .45)
  (-.25 -.25 .55)
  (8.25 -.25 .55)
  (8.25 4.75 .55)
  (-.25 4.75 .55)
);

blocks (
  hex (0 1 2 3 4 5 6 7) (136 72 1) simpleGrading (1 1 1)
);

edges ();
boundary ();
mergePatchPairs();
