of-run/damBreakSnappyV2/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField {
  allwall {
    type  fixedFluxPressure;
    value uniform 0;
  }
  atmosphere {
    type  totalPressure;
    p0    uniform 0;
    U     U;
    phi   phi;
    rho   rho;
    psi   none;
    gamma 1;
    value uniform 0;
  }
  defaultFaces { type empty; }
}

// ************************************************************************* //
